Masmiseim36/nxpSDK/boards/evkbmimxrt1170/bootloader_examples/flashloader/cm4/pin_mux.h
/*
 * Copyright 2020 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/***********************************************************************************************************************
 * Definitions
 **********************************************************************************************************************/

/*! @brief Direction type  */
typedef enum _pin_mux_direction
{
  kPIN_MUX_DirectionInput = 0U,         /* Input direction */
  kPIN_MUX_DirectionOutput = 1U,        /* Output direction */
  kPIN_MUX_DirectionInputOrOutput = 2U  /* Input or output direction */
} pin_mux_direction_t;

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/* GPIO_AD_25 (coord M15), UART1_RX_PIN */
/* Routed pin properties */
#define UART1_POLLFORACTIVITY_UART_RX_DETECT_PERIPHERAL                CM7_GPIO3   /*!< Peripheral name */
#define UART1_POLLFORACTIVITY_UART_RX_DETECT_SIGNAL              gpio_mux_io_cm7   /*!< Signal name */
#define UART1_POLLFORACTIVITY_UART_RX_DETECT_CHANNEL                         24U   /*!< Signal channel */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void UART1_PollForActivity(void);             /* Function assigned for the Cortex-M7F */

/* GPIO_AD_25 (coord M15), UART1_RX_PIN */
/* Routed pin properties */
#define UART1_UART1_RX_PIN_PERIPHERAL                                    LPUART1   /*!< Peripheral name */
#define UART1_UART1_RX_PIN_SIGNAL                                            RXD   /*!< Signal name */

/* GPIO_AD_24 (coord L13), UART1_TX_PIN */
/* Routed pin properties */
#define UART1_UART1_TX_PIN_PERIPHERAL                                    LPUART1   /*!< Peripheral name */
#define UART1_UART1_TX_PIN_SIGNAL                                            TXD   /*!< Signal name */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void UART1_InitPins(void);                    /* Function assigned for the Cortex-M7F */

/* GPIO_AD_24 (coord L13), UART1_TX_PIN */
/* Routed pin properties */
#define UART1_RESTOREDEFAULT_UART1_TX_PIN_PERIPHERAL                     LPUART1   /*!< Peripheral name */
#define UART1_RESTOREDEFAULT_UART1_TX_PIN_SIGNAL                             TXD   /*!< Signal name */

/* GPIO_AD_25 (coord M15), UART1_RX_PIN */
/* Routed pin properties */
#define UART1_RESTOREDEFAULT_UART1_RX_PIN_PERIPHERAL                     LPUART1   /*!< Peripheral name */
#define UART1_RESTOREDEFAULT_UART1_RX_PIN_SIGNAL                             RXD   /*!< Signal name */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void UART1_RestoreDefault(void);              /* Function assigned for the Cortex-M7F */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
